[
    {
        "id": "01",
        "name": "Html",
        "details": "HTML (HyperText Markup Language) is the most basic building block of the Web. It defines the meaning and structure of web content. Other technologies besides HTML are generally used to describe a web page's appearance/presentation (CSS) or functionality/behavior (JavaScript). Hypertext refers to links that connect web pages to one another, either within a single website or between websites. Links are a fundamental aspect of the Web. By uploading content to the Internet and linking it to pages created by other people, you become an active participant in the World Wide Web. HTML uses markup to annotate text, images, and other content for display in a Web browser. HTML markup includes special elements such as <head/>, <title/>, <body/>, <header/>, <footer/>,<article/>, <section/>, <p/>, <div/>, <span/>, <img/>, <aside/>, <audio/>, <canvas/>, <datalist/>, <details/>, <embed/>, <nav/>, <output/>, <progress/>, <video/>, <ul/>, <ol/>, <li/> and many others. Originally, HTML was developed with the intent of defining the structure of documents like headings, paragraphs, lists, and so forth to facilitate the sharing of scientific information between researchers. Now, HTML is being widely used to format web pages with the help of different tags available in HTML language.",
        "photo_URL": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/HTML5_logo_and_wordmark.svg/1200px-HTML5_logo_and_wordmark.svg.png"
    },
    {
        "id": "02",
        "name": "CSS",
        "details": "Cascading Style Sheets (CSS) is a style sheet language used for describing the presentation of a document written in a markup language such as HTML or XML (including XML dialects such as SVG, MathML or XHTML). CSS is a cornerstone technology of the World Wide Web, alongside HTML and JavaScript. CSS is designed to enable the separation of presentation and content, including layout, colors, and fonts. This separation can improve content accessibility; provide more flexibility and control in the specification of presentation characteristics; enable multiple web pages to share formatting by specifying the relevant CSS in a separate .css file, which reduces complexity and repetition in the structural content; and enable the .css file to be cached to improve the page load speed between the pages that share the file and its formatting. Separation of formatting and content also makes it feasible to present the same markup page in different styles for different rendering methods, such as on-screen, in print, by voice (via speech-based browser or screen reader), and on Braille-based tactile devices. CSS also has rules for alternate formatting if the content is accessed on a mobile device. The name cascading comes from the specified priority scheme to determine which style rule applies if more than one rule matches a particular element. This cascading priority scheme is predictable.",
        "photo_URL": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/CSS3_logo_and_wordmark.svg/1200px-CSS3_logo_and_wordmark.svg.png"
    },
    {
        "id": "03",
        "name": "JavaScript",
        "details": "JavaScript is a high-level programming language that follows the ECMAScript standard. It was originally designed as a scripting language for websites but became widely adopted as a general-purpose programming language, and is currently the most popular programming language in use.[1] JavaScript is usually found running in a web browser as interactive or automated content, ranging from popup messages and live clocks to large web applications. JavaScript is also commonly used in server-side programming through platforms like Node.js  or embedded in non-JavaScript applications where the base programming language lacks the high-level functionality that JavaScript offers.JavaScript is also used outside of web browsers. As a scripting language, JavaScript can be used to define the behaviour of applications such as extensions in GNOME Shell. In addition  there are runtime environments for running JavaScript as a server side programming language. Such an environment is Node.js. Electron is a framework which allows graphical applications to be made with web technologies by running on the Chromium browser and Node.js.",
        "photo_URL": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/220px-Unofficial_JavaScript_logo_2.svg.png"
    },
    {
        "id": "04",
        "name": "React",
        "details": "React (also known as React.js or ReactJS) is a free and open-source front-end JavaScript library for building user interfaces based on UI components. It is maintained by Meta (formerly Facebook) and a community of individual developers and companies. React can be used as a base in the development of single-page, mobile, or server-rendered applications with frameworks like Next.js. However, React is only concerned with state management and rendering that state to the DOM, so creating React applications usually requires the use of additional libraries for routing, as well as certain client-side functionality. React code is made of entities called components. These components are reusable and must be formed in the SRC folder following the Pascal Case as its naming convention (capitalize camelCase). Components can be rendered to a particular element in the DOM using the React DOM library. When rendering a component, one can pass the values between components through props. React does not attempt to provide a complete application library. It is designed specifically for building user interfaces[3] and therefore does not include many of the tools some developers might consider necessary to build an application. This allows the choice of whichever libraries the developer prefers to accomplish tasks such as performing network access or local data storage. Common patterns of usage have emerged as the library matures.",
        "photo_URL": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/React-icon.svg/1200px-React-icon.svg.png"
    },
    {
        "id": "05",
        "name": "Firebase",
        "details": "Firebase evolved from Envolve, a prior startup founded by James Tamplin and Andrew Lee in 2011. Envolve provided developers an API that enables the integration of online chat functionality into their websites. After releasing the chat service, Tamplin and Lee found that it was being used to pass application data that were not chat messages. Developers were using Envolve to sync application data such as game state in real time across their users. Tamplin and Lee decided to separate the chat system and the real-time architecture that powered it.[1] They founded Firebase as a separate company in 2011 and it launched to the public in April 2012. Firebase's first product was the Firebase Realtime Database, an API that synchronizes application data across iOS Android and Web devices and stores it on Firebase's cloud. The product assists software developers in building real-time collaborative applications. In May 2012 a month after the beta launch Firebase raised $1.1 million in seed funding from venture capitalists Flybridge Capital Partners Greylock Partners Founder Collective and New Enterprise Associates. In June 2013 the company further raised $5.6 million in Series A funding from Union Square Ventures and Flybridge Capital Partners.  In 2014 Firebase launched two products: Firebase Hosting and Firebase Authentication. This positioned the company as a mobile backend as a service.  In October 2014 Firebase was acquired by Google. A year later in October 2015 Google acquired Divshot an HTML5 web-hosting platform to merge it with the Firebase team. In May 2016 at Google I/O the company's annual developer conference Firebase introduced Firebase Analytics and announced that it was expanding its services to become a unified backend-as-a-service (BaaS) platform for mobile developers. Firebase now integrates with various other Google services including Google Cloud Platform AdMob and Google Ads to offer broader products and scale for developers. Google Cloud Messaging the Google service to send push notifications to Android devices was superseded by a Firebase product Firebase Cloud Messaging which added the functionality to deliver push notifications to both iOS and web devices. In July 2016 Google announced that it was acquiring the mobile developer platform LaunchKit which specialized in app developer marketing and would be folding it into the Firebase Growth Tools team.",
        "photo_URL": "https://media-thumbs.golden.com/dicg-bjat2y9UulHJiXz3ElW3Ww=/200x200/smart/golden-media.s3.amazonaws.com%2Ftopic_images%2Fccdf39280f544140911153227860de35.png"
    },
    {
        "id": "06",
        "name": "GitHub",
        "details": "Development of the GitHub.com platform began on October 19, 2007. The site was launched in April 2008 by Tom Preston-Werner, Chris Wanstrath, P. J. Hyett and Scott Chacon after it had been made available for a few months prior as a beta release. GitHub has an annual keynote called GitHub Universe. GitHub.com was a bootstrapped start-up business, which in its first years provided enough revenue to be funded solely by its three founders and start taking on employees. In July 2012, four years after the company was founded, Andreessen Horowitz invested $100 million in venture capital. In July 2015 GitHub raised another $250 million of venture capital in a series B round. Investors were Sequoia Capital, Andreessen Horowitz, Thrive Capital, and other venture capital funds. As of 2018, GitHub was estimated to be generating $200-300 million in Annual Recurring Revenue. The GitHub service was developed by Chris Wanstrath, P. J. Hyett, Tom Preston-Werner, and Scott Chacon using Ruby on Rails, and started in February 2008. The company, GitHub, Inc., has existed since 2007 and is located in San Francisco. On February 24, 2009, GitHub announced that within the first year of being online, GitHub had accumulated over 46,000 public repositories, 17,000 of which were formed in the previous month. At that time, about 6,200 repositories had been forked at least once and 4,600 had been merged. That same year, the site was used by over 100,000 users, according to GitHub, and had grown to host 90,000 unique public repositories, 12,000 having been forked at least once, for a total of 135,000 repositories.",
        "photo_URL": "https://upload.wikimedia.org/wikipedia/commons/9/91/Octicons-mark-github.svg"
    }
]